
## ==============================================================
## 매개변수(parameter) : 함수에 입력으로 전달된 값을 받는 변수
## 인수(arguments) : 함수를 호출할 때 전달하는 입력값
## ==============================================================

# 예시
def add(a,b): # a,b는 매개변수
    return a+b

print(add(3,4)) # 3,4는 인수


## ==============================================================
## 함수 입력값이 몇개가 될지 모를 때 (157p)
## ==============================================================
## def 함수이름(*매개변수):
##     수행할 문장
## ==============================================================

# 예시
def add_many(*args): # args 대신 아무 이름을 써도 된다
    result = 0 
    for i in args:
        result = result + i # args에 입력받은 값을 모두 더한다
    return result 

print(add_many(1,2,3,4,5,6,7,8,9,10)) # 입력값을 모두 모아서 튜플로 만들어준다


## ==============================================================
## 여러개의 입력을 처리해야할 경우
## ==============================================================

# 예시
def add_mul(choice, *args):
    if choice == 'add':
        result = 0
        for i in args:
            result = result + i
    
    elif choice == 'mul':
        result = 1
        for i in args:
            result = result * i 
    return result

print('add result: ', add_mul('add', 1,2,3,4,5)) # 15
print('mul result: ', add_mul('mul', 1,2,3,4,5)) # 120

