## ==============================================================
## list 안에 for문을 포함하기 (144p)
## ==============================================================
## 리스트 컴프리헨션(list comprehension)
## [(표현식) for (항목) in (반복 가능 객체) if (조건)]
## ==============================================================

# 예시
a = [1,2,3,4,5]
result = []
for num in a:
    result.append(num*3)
print('Before : ', result) # [3,6,9,12,15]


# 적용후
result = [num*3 for num in a]
print('After 1 : ', result)

# 짝수에만 적용하고싶은 경우 (if문까지 쓰려고)
result = [num*3 for num in a if num%2==0]
print('After 2 : ', result)

## ==============================================================
## for문을 2개 이상 사용하는 것도 가능함
## ==============================================================
## [(표현식) for (항목1) in (반복 가능객체1) if (조건1)
##           for (항목2) in (반복 가능객체2) if (조건2)
##           ...
##           for (항목n) in (반복 가능객체n) if (조건n)]
## ==============================================================

# 예시 - 구구단(2중 for문)

gugudan = [dan*n for dan in range(2,10)
                for n in range(1,10)]
print('gugudan: ', gugudan)

